---
kind: type
id: T:Autodesk.Revit.DB.IFC.IFCOpeningData
source: html/5ffa1b2d-09e0-40a2-2bd5-5398024ef297.htm
---
# Autodesk.Revit.DB.IFC.IFCOpeningData

A class that contains opening data including extrusion data, opening solids and opening element id.

## Syntax (C#)
```csharp
public class IFCOpeningData : IDisposable
```